app/views/flights/show.html.erb


<%= render "seat_list", seats: Seat.where(flight_id: @flight.id) %>
---
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 1]]