app/controllers/pages_controller.rb

	def new_login
		@username = params[:username]
		@password = params[:password]

		@u = User.find_by(username: @username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "shania_aman"], ["LIMIT", 1]]